In [44]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
import numpy as np
import pandas as pd

In [2]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [4]:
# Select the value in the first row (0) and the first column (A) using .loc.

In [7]:
df.loc[0, 'A']

0

In [8]:
df.loc[0, 'B']

10

In [9]:
df.loc[0, 'C']

20

In [10]:
df.loc[0, 'C']

20

In [12]:
df.loc[0, 'C']

20

In [ ]:
# Using .loc, how would you select all columns for the third row (index 2)?

In [13]:
df.loc[2]

A     2
B    12
C    22
Name: 2, dtype: int64

In [15]:
df.loc[:, 'A']

0    0
1    1
2    2
3    3
4    4
Name: A, dtype: int64

In [17]:
df.loc[:, 'B']

0    10
1    11
2    12
3    13
4    14
Name: B, dtype: int64

In [19]:
df.loc[[1,2], ['A', 'B']]

   A   B
1  1  11
2  2  12

In [20]:
df.loc[(1,2), ('A', 'B')]

   A   B
1  1  11
2  2  12

In [21]:
df.loc[:, 'C']

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [24]:
df[df.loc[:, 'C'] > 22]

   A   B   C
3  3  13  23
4  4  14  24

In [26]:
df.loc[df['C'] > 22]

   A   B   C
3  3  13  23
4  4  14  24

In [30]:
df[df['C'] > 12]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [31]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [32]:
df.loc[0, 'B'] = 100

C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_5208\806916224.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[0, 'B'] = 100

In [33]:
df

   A    B   C
0  0  100  20
1  1   11  21
2  2   12  22
3  3   13  23
4  4   14  24

In [34]:
df

   A    B   C
0  0  100  20
1  1   11  21
2  2   12  22
3  3   13  23
4  4   14  24

In [35]:
df.loc[df['C'] > 20]

   A   B   C
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [42]:
df.loc[df['C'] > 20, 'A'] = 50

C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_5208\3708170248.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[df['C'] > 20, 'A'] = 50

In [43]:
df

    A    B   C
0   0  100  20
1  50   11  21
2  50   12  22
3  50   13  23
4  50   14  24

In [47]:
df.loc[(df['A'] == 20) & (df['C'] > 21), 'B'] = 200

In [48]:
df

    A    B   C
0   0  100  20
1  50   11  21
2  50  200  22
3  50  200  23
4  50  200  24

In [49]:
df.loc[1:4, ("A", "C")]

    A   C
1  50  21
2  50  22
3  50  23
4  50  24

In [51]:
# LOC is Label Based Indexiing so 1:3 means 1, 2, 3 - INCLUSIVE
# Python in Position based indexing, so 1:3 means 1, 2

In [53]:
df.loc[(df['C'] != 21) & (df['A'] < 3), 'B'] = 300

In [54]:
df

    A    B   C
0   0  300  20
1  50   11  21
2  50  200  22
3  50  200  23
4  50  200  24

In [56]:
df.loc[(df['A'] < 3) & (df['C'] > 20), ("B", "C")]

Empty DataFrame
Columns: [B, C]
Index: []

In [58]:
df.loc[(df['A'] < 3) & (df['C'] > 10), ("B", "C")]

     B   C
0  300  20

In [59]:
df.loc[(df['A'] < 3), ('B', 'C')]

     B   C
0  300  20

In [64]:
df.loc[(df['B'] >=1) & (df['B'] <=13), 'B'] = 500 
df

    A    B    C
0   0  300   20
1  50  500  500
2  50  200   22
3  50  200   23
4  50  200   24

In [67]:
df.loc[(df['A'] != 2) & (df['B'] != 12), ("A", "B")]

    A    B
0   0  300
1  50  500
2  50  200
3  50  200
4  50  200

In [70]:
df.loc[df['A'] ==50, 'C'] = df['B']

In [71]:
df

    A    B    C
0   0  300   20
1  50  500  500
2  50  200  200
3  50  200  200
4  50  200  200

In [72]:
df['A']

0     0
1    50
2    50
3    50
4    50
Name: A, dtype: int64

In [81]:
df.loc[df['A'].isin([1,2,3])]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [82]:
df.loc[df['B'].isin([11, 14])]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [83]:
df.loc[~df['B'].isin([11, 14])]

    A    B    C
0   0  300   20
1  50  500  500
2  50  200  200
3  50  200  200
4  50  200  200

In [85]:
df.loc[~df['B'].isin([11, 200])]

    A    B    C
0   0  300   20
1  50  500  500

In [90]:
df["C"] = 'Zomato'

In [91]:
df.loc[df['C'].str.contains('Z'), 'B'] = 999

In [92]:
df

    A    B       C
0   0  999  Zomato
1  50  999  Zomato
2  50  999  Zomato
3  50  999  Zomato
4  50  999  Zomato

In [107]:
df.loc[df.shape[0]-3:, ('A', 'B')]

    A    B
2  50  999
3  50  999
4  50  999

In [110]:
df.loc[df['A'] < 2, 'B'] = 'low'
df.loc[(df['A'] > 2) & (df['A'] < 3), 'B'] = 'medium'
df.loc[df['A'] > 3, 'B'] = 'high'

In [111]:
df

    A     B       C
0   0   low  Zomato
1  50  high  Zomato
2  50  high  Zomato
3  50  high  Zomato
4  50  high  Zomato

In [116]:
def categorize(given_value):
    if given_value < 2:
        return 'low'
    elif given_value > 2 & given_value < 3:
        return 'medium'
    else:
        return 'high'
df['D'] = df['A'].apply(categorize)

In [117]:
df

    A     B       C       D
0   0   low  Zomato     low
1  50  high  Zomato  medium
2  50  high  Zomato  medium
3  50  high  Zomato  medium
4  50  high  Zomato  medium

In [118]:
df.loc[~df['C'].isnull()]

    A     B       C       D
0   0   low  Zomato     low
1  50  high  Zomato  medium
2  50  high  Zomato  medium
3  50  high  Zomato  medium
4  50  high  Zomato  medium